class Model {
  Model({
    required this.titlezekr,
    this.referance,
    this.note,
    required this.contant,
    required this.repeat,
  });
  final String titlezekr;
  final String contant;
  final int repeat;
  final String? referance;
  final String? note;
}

List<Model> slepping = [
  Model(
    titlezekr: 'سورة البقرة: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
    contant:
        'آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. ',
    referance: 'البقرة 285 - 286',
    note: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.',
    repeat: 1,
  ),
  Model(
    titlezekr: 'آية الكرسى: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
    contant:
        'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.',
    repeat: 1,
    referance: 'البقرة 255',
    note: 'أجير من الجن حتى يصبح.',
  ),
  Model(
    titlezekr: 'أذكار من قلق في فراشه ولم ينم',
    contant:
        'عن بريدة رضي الله عنه قال: شكا خالد بن الوليد رضي الله عنه إلى النبي ﷺ فقال: يا رسول الله! ما أنام الليل من الأرق، فقال ﷺ: "إذا أويت إلى فراشك فقل: اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك، ولا إله غيرك، ولا إله إلا أنت". وعن عمرو بن شعيب، عن أبيه، عن جده أن رسول الله ﷺ كان يعلمهم من الفزع كلمات: "أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون".',
    repeat: 1,
  ),
  Model(
    titlezekr: 'أذكار الأحلام',
    contant:
        'عن أبي قتادة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الرؤيا الصالحة" وفي رواية "الرؤيا الحسنة من الله، والحلم من الشيطان، فمن رأى شيئًا يكرهه فلينفث عن شماله ثلاثًا، وليتعوذ من الشيطان، فإنها لا تضره".',
    repeat: 1,
  ),
  Model(
    titlezekr: 'دعاء النوم',
    contant:
        'بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين. ',
    repeat: 1,
  ),
  Model(
    titlezekr: 'دعاء طلب العافية',
    contant:
        'اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة. ',
    repeat: 1,
  ),
  Model(
    titlezekr: 'دعاء القن من العذاب',
    contant: 'اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك.',
    repeat: 3,
  ),
  Model(
    titlezekr: 'ذكر قبل النوم',
    contant: 'بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا.',
    repeat: 1,
  ),
  Model(
    titlezekr: 'حمد الله قبل النوم',
    contant:
        'الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي.',
    repeat: 1,
  ),
  Model(
    titlezekr: 'دعاء الاستعاذة',
    contant:
        'اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم . ',
    repeat: 1,
  ),
  Model(
    titlezekr: 'دعاء التفويض والتوكل',
    contant:
        'اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت. ',
    repeat: 1,
  ),
  Model(
    titlezekr: 'التسبيح قبل النوم',
    contant:
        'سبحان الله (33) - الحمد لله (33) - الله أكبر (34) - لا إله إلا الله ...',
    repeat: 100,
  ),
  Model(
    titlezekr: 'المعوذات والنفث باليد',
    contant:
        'كان النبي ﷺ إذا أوى إلى فراشه يجمع كفيه وينفث فيهما ويقرأ "قل هو الله أحد" و"قل أعوذ برب الفلق" و"قل أعوذ برب الناس" ويمسح بهما ما استطاع من جسده يبدأ برأسه ووجهه وما أقبل من جسده، ويكرر ذلك ثلاث مرات.',
    repeat: 3,
  ),
];
List<Model> morningazkar = [
  Model(
    titlezekr: 'حديث شريف',
    contant:
        'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
    repeat: 100,
    referance: 'رواه الترمذي',
    note:
        'من قالها 100 مرة في يوم كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان في يومه ذلك حتى يمسي ولم يأتي أحد بأفضل مما جاء به إلا احد عمل أكثر من ذلك',
  ),
  Model(
    titlezekr: 'حديث شريف',
    contant: 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.',
    repeat: 10,
    referance: 'رواه الطبراني',
    note: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
  ),
  Model(
    titlezekr: 'حديث شريف',
    contant: 'سُبْحانَ اللهِ وَبِحَمْدِهِ.',
    repeat: 100,
    referance: 'رواه مسلم',
    note:
        'من قال : سبحان اللهِ وبحمدِه مائةَ مرةٍ غُفرَتْ له ذنوبُه وإنْ كانتْ مثلَ زبَدِ البحرِ',
  ),
  Model(
    titlezekr: 'حديث شريف',
    contant: 'أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ',
    repeat: 100,
    referance: 'رواه البخاري',
  ),
  Model(
    titlezekr: 'ايه الكرسي',
    contant:
        'اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ',
    repeat: 1,
    referance: 'آية الكرسى - سورة البقرة 255',
    note:
        'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.',
  ),
  Model(
    titlezekr: 'سوره الإخلاص',
    contant:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾ ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ﴿٣﴾ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ﴿٤﴾',
    repeat: 3,
    note: 'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
  ),
  Model(
    contant:
        'سْمِ اللهِ الرَّحْمنِ الرَّحِيمقُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾',
    titlezekr: 'سورة الفلق',
    repeat: 3,
    note: 'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
  ),
  Model(
    titlezekr: 'سورة الناس',
    contant:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمقُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ﴿١﴾ مَلِكِ ٱلنَّاسِ ﴿٢﴾ إِلَٰهِ ٱلنَّاسِ ﴿٣﴾ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ﴿٤﴾ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ﴿٥﴾ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ﴿٦﴾',
    repeat: 3,
    note: 'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
  ),
  Model(
    contant:
        'أَصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْأَلُكَ خَيرَ ما في هذا اليوم وَخَيرَ ما بَعْدَه ، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُبِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر ، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر.',
    titlezekr: 'حديث',
    repeat: 1,
    referance: 'رواه مسلم',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَني وَأَنا عَبْدُك ، وَأَنا عَلى عَهْدِكَ وَوَعْدِكَ ما اسْتَطَعْت ، أَعوذُبِكَ مِنْ شَرِّ ما صَنَعْت ، أَبوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبوءُ بِذَنْبي فَاغْفِرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنوبَ إِلاّ أَنْتَ .',
    repeat: 1,
    note: 'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.',
    referance: 'رواه البخاري',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُك ، وَأُشْهِدُ حَمَلَةَ عَرْشِك ، وَمَلَائِكَتَكَ ، وَجَميعَ خَلْقِك ، أَنَّكَ أَنْتَ اللهُ لا إلهَ إلاّ أَنْتَ وَحْدَكَ لا شَريكَ لَك ، وَأَنَّ ُ مُحَمّداً عَبْدُكَ وَرَسولُك.',
    repeat: 4,
    referance: 'رواه أبو داود',
    note: 'من قالها أعتقه الله من النار.',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهُمَّ ما أَصْبََحَ بي مِنْ نِعْمَةٍ أَو بِأَحَدٍ مِنْ خَلْقِك ، فَمِنْكَ وَحْدَكَ لا شريكَ لَك ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر.',
    repeat: 1,
    note: 'من قالها حين يصبح أدى شكر يومه.',
    referance: 'رواه أبو داود',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.',
    repeat: 7,
    note: 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.',
    referance: 'رواه السني',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'بِسمِ اللهِ الذي لا يَضُرُّ مَعَ اسمِهِ شَيءٌ في الأرْضِ وَلا في السّماءِ وَهوَ السّميعُ العَليم.',
    repeat: 3,
    referance: 'رواه ابن ماجة',
    note: 'لم يضره من الله شيء.',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهُمَّ بِكَ أَصْبَحْنا وَبِكَ أَمْسَينا ، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُور.',
    repeat: 1,
    referance: 'رواه الترمذي',
  ),
  Model(
    titlezekr: ' حديث',
    contant:
        'أَصْبَحْنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
    repeat: 1,
    referance: 'رواه أحمد',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهُمَّ عافِني في بَدَني ، اللّهُمَّ عافِني في سَمْعي ، اللّهُمَّ عافِني في بَصَري ، لا إلهَ إلاّ أَنْتَ.',
    repeat: 3,
    referance: 'رواه أحمد',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهُمَّ إِنّي أَعوذُ بِكَ مِنَ الْكُفر ، وَالفَقْر ، وَأَعوذُ بِكَ مِنْ عَذابِ القَبْر ، لا إلهَ إلاّ أَنْتَ.',
    repeat: 3,
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَالعافِيةَ في الدُّنْيا وَالآخِرَة ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَالعافِيةَ في ديني وَدُنْيايَ وَأهْلي وَمالي ، اللّهُمَّ اسْتُرْ عوْراتي وَآمِنْ رَوْعاتي ، اللّهُمَّ احْفَظْني مِن بَينِ يَدَيَّ وَمِن خَلْفي وَعَن يَميني وَعَن شِمالي ، وَمِن فَوْقي ، وَأَعوذُ بِعَظَمَتِكَ أَن أُغْتالَ مِن تَحْتي.',
    repeat: 1,
    referance: 'رواه أبو داود',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَرْفَةَ عَيْنٍ.',
    repeat: 3,
    referance: 'رواه الترمذي',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'أَصْبَحْنا وَأَصْبَحْ المُلكُ للهِ رَبِّ العالَمين ، اللّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هذا اليَوْم ، فَتْحَهُ ، وَنَصْرَهُ ، وَنورَهُ وَبَرَكَتَهُ ، وَهُداهُ ، وَأَعوذُ بِكَ مِنْ شَرِّ ما فيهِ وَشَرِّ ما بَعْدَه.',
    repeat: 1,
    referance: 'رواه أبو داود',
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللّهُمَّ عالِمَ الغَيْبِ وَالشّهادَةِ فاطِرَ السّماواتِ وَالأرْضِ رَبَّ كلِّ شَيءٍ وَمَليكَه ، أَشْهَدُ أَنْ لا إِلهَ إِلاّ أَنْت ، أَعوذُ بِكَ مِن شَرِّ نَفْسي وَمِن شَرِّ الشَّيْطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلى نَفْسي سوءاً أَوْ أَجُرَّهُ إِلى مُسْلِم.',
    repeat: 1,
    referance: 'رواه الترمذي',
  ),
  Model(
    titlezekr: 'حديث',
    contant: 'أَعوذُ بِكَلِماتِ اللّهِ التّامّاتِ مِنْ شَرِّ ما خَلَق.',
    repeat: 3,
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
    repeat: 3,
  ),
  Model(
    titlezekr: 'حديث',
    contant:
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.',
    repeat: 3,
    referance: 'رواه أبو داود',
  ),
];
List<Model> eveningAzkar = [
  Model(
    titlezekr: 'حديث',
    contant:
        'أَمْسَيْنا وَأَمْسى الملكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْأَلُكَ خَيرَ ما في هذهِ اللَّيْلَةِ وَخَيرَ ما بَعْدَها ، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذهِ اللَّيْلةِ وَشَرِّ ما بَعْدَها ، رَبِّ أَعوذُبِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر ، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر.',
    repeat: 1,
    referance: 'رواه مسلم',
  ),
  Model(
    titlezekr: 'ايه الكرسي',
    contant:
        'اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ',
    repeat: 1,
    referance: 'آية الكرسى - سورة البقرة 255',
    note:
        'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.',
  ),
];
List<Model> postPrayerAzkar = [
  Model(
    titlezekr: 'استغفار بعد الصلاة',
    contant: 'استغفر الله ، استغفر الله ، استغفر الله .',
    repeat: 3,
  ),
  Model(
    titlezekr: 'اللهم أنت السلام',
    contant: 'اللهم انت السلام ، ومنك السلام ، تباركت يا ذا الجلال والاكرام',
    repeat: 1,
  ),
  Model(
    titlezekr: 'دعاء لا إله إلا الله ',
    contant:
        'لا اله الا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ، لا حول ولا قوة الا بالله ، لا اله الا الله ، ولا نعبد إلا اياه ، له النعمة وله الفضل وله الثناء الحسن ، لا اله الا الله مخلصين له الدين ولو كره الكافرون ',
    repeat: 1,
  ),
  Model(
    titlezekr: 'التسبيح',
    contant:
        'سبحان الله (33) - الحمد لله (33) - الله أكبر (33) - لا إله إلا الله ...',
    repeat: 100,
  ),
  Model(
    titlezekr: 'المعوذتين والإخلاص',
    contant:
        'قراءة سورة الاخلاص ( قل هو الله أحد ) ، سورة الفلق ، ( قل اعوذ برب الفلق . . . ) ، سورة الناس ( قل اعوذ برب الناس . . . )',
    repeat: 1,
  ),
  Model(
    titlezekr: 'آية الكرسي',
    contant:
        'اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ',
    repeat: 1,
  ),
  Model(
    titlezekr: 'ذكر بعد المغرب والصبح',
    contant:
        'لا اله الا الله وحده لا شريك له ، له الملك وله الحمد ، يحيي ويميت وهو على كل شيء قدير (10 مرات بعد صلاة المغرب والصبح)',
    repeat: 10,
  ),
];
